Repository: doc-l10n-kit/ja-infinispan
Catalog: l10n/tmx/infinispan.tmx
Source language: en
Languages: ja_jp

source: Infinispan turbocharges applications by storing data closer to processing logic, which reduces latency and increases throughput.
ja_jp: Infinispanは、データを処理ロジックの近くに格納し、レイテンシーを減らし、スループットを向上させることで、アプリケーションを加速します。

source: Available as a Java library, you simply add Infinispan to your application dependencies and then you’re ready to store data in the same memory space as the executing code.
ja_jp: Javaライブラリとして提供されており、アプリケーションにInfinispanを追加するだけで、実行コードと同じメモリ空間にデータを格納できます。

source: If you want to provision a data layer that is independent of your applications, you can use Infinispan Server for remote access to data with in-memory performance. Clients are a single network hop away from data through consistent hashing techniques and can make requests over HTTP or with a custom binary TCP protocol called Hot Rod.
ja_jp: アプリケーションから独立したデータ・レイヤーを用意したい場合、Infinispan Serverを使ってインメモリ・パフォーマンスでデータにリモート・アクセスできます。クライアントは、一貫したハッシュ技術によってデータからネットワークで１ホスト分離れており、HTTPまたはHot Rodと呼ばれるカスタムバイナリTCPプロトコルでリクエストを行えます。

source: Infinispan clusters running in different geographical locations can form global clusters to back up your data across sites. If sites go offline clients can immediately switch to an available cluster, making sure data center faults do not cause service interruptions.
ja_jp: 地理的に異なる場所で動作するInfinispanクラスタは、グローバルクラスタを形成し、拠点間でデータをバックアップできます。拠点がオフラインになっても、クライアントはすぐに利用可能なクラスタに切り替えることができるため、データセンタの障害によるサービスの中断を防げます。

source: When using the Infinispan Operator with Kubernetes environments such as Red Hat OpenShift, cross-site replication capabilities make your data ready for hybrid and multi cloud deployments.
ja_jp: Infinispan OperatorをRed Hat OpenShiftなどのKubernetes環境で使用する場合、拠点横断レプリケーション機能により、データをハイブリッドやマルチクラウドの展開に対応できます。

source: Infinispan also guarantees data consistency when using cross-site replication, even in cases where clients make concurrent writes at different locations that use asynchronous replication. So your data is always there and always accurate, no matter where you’re running.
ja_jp: また、Infinispanは拠点横断レプリケーションを使用する際、非同期レプリケーションを使用する異なる場所でクライアントが同時に書き込みを行う場合でも、データの一貫性を保証します。そのため、どこで実行していても、データは常にそこにあり、常に正確です。

source: IInfinispan provides trusted open-source technology to deliver scalability to meet workload demands and reduce resource utilization. At the same time, Infinispan distributes your data across clusters so no single point of failure causes data loss.
ja_jp: IInfinispanは信頼できるオープンソースの技術を提供し、負荷量の要求を満たす拡張性を実現し、リソースの使用率を低減します。同時に、Infinispanはデータをクラスタに分散させるため、単一障害点によるデータ損失が発生しません。

source: One popular use for Infinispan is as a shared store for stateful data, such as user HTTP sessions. Applications can stay lightweight and avoid heap usage by externalizing sessions to Infinispan clusters, which act as an independent data layer.
ja_jp: Infinispanは、ユーザのHTTPセッションのようなステートフルなデータの共有ストアとしてよく使われます。アプリケーションは、セッションをInfinispanクラスタに外部化し、独立したデータ層として機能させることで、軽量化とヒープの使用を避けられます。

source: layout: experiments title: Experiments subtitle: Any open source project has an experimental side as part of its DNA. Infinispan goes a step further and experiments with academic and research projects. permalink: /experiments/
ja_jp: layout: experiments title: 実験 subtitle: どんなオープンソース・プロジェクトも、そのDNAの一部として実験的な側面を持っています。Infinispanはさらに一歩進んで、学術的なプロジェクトや研究プロジェクトで実験を行っています。 permalink: /experiments/

source: layout: tutorials title: Tutorials subtitle: Infinispan is easy. Let us walk you through it! permalink: /tutorials/
ja_jp: layout: tutorials title: チュートリアル subtitle: Infinispanは簡単です。私たちがご案内しましょう！ permalink: /tutorials/

source: Dear Infinispan community,
ja_jp: 親愛なるInfinispanのコミュニティへ

source: Infinispan 12 development release 03 is here!
ja_jp: Infinispan 12 開発リリース03はこちら！

source: Cross Site Replication
ja_jp: 拠点横断レプリケーション

source: With the new asynchronous cross-site replication algorithm introduced in Infinispan 11, this release brings a long desired feature: *conflict resolution*.
ja_jp: Infinispan 11で導入された新しい非同期拠点横断レプリケーションアルゴリズムにより、このリリースでは、長い間望まれていた機能である *競合の解決* が実現しました。

source: It is possible to configure a merge policy where, in case of conflict between updates of different sites, the value can be merged. Some predefined merge policies can be found https://docs.jboss.org/infinispan/12.0/apidocs/org/infinispan/xsite/spi/XSiteMergePolicy.html[here].
ja_jp: 異なる拠点の更新が衝突した場合に、バリューをマージするマージ方針を設定できます。いくつかの定義済みマージ方針は、 link:https://docs.jboss.org/infinispan/12.0/apidocs/org/infinispan/xsite/spi/XSiteMergePolicy.html[ここで] 見つけられます。

source: See the docs for more https://infinispan.org/docs/dev/titles/xsite/xsite.html#conflict_resolution-xsite[information about conflict resolution].
ja_jp: link:https://infinispan.org/docs/dev/titles/xsite/xsite.html#conflict_resolution-xsite[衝突解決についての情報] は、ドキュメントを参照してください。

source: Performance improvement
ja_jp: 性能改善

source: Another small improvement has been made to cross-site replication in this release. When sites get requests targeting caches that don't exist or aren't started, sender sites stop retrying the requests, which takes the backup location offline. Administrators must then bring the sites back online and perform state transfer to sync possible out-of-date data.
ja_jp: このリリースでは、拠点横断レプリケーションにも小さな改良が加えられています。拠点が、存在しないまたは起動していないキャッシュをターゲットにしたリクエストを受け取ると、送信元の拠点はリクエストの再試行を停止し、バックアップ先をオフラインにします。管理者は、その後、拠点をオンラインに戻し、古いデータを同期させるために状態遷移を実行しなければなりません。

source: This version includes a new version of the web console, including mainly fixes, but also the ability to filter between Strong and Weak counters and to remove counters from the list.
ja_jp: このバージョンでは、主に修正を含むWebコンソールの新バージョンが追加されていますが、StrongカウンターとWeakカウンターの間でフィルターをかけたり、カウンターをリストから削除したりする機能も追加されています。

source: Console: counters list
ja_jp: コンソール: カウンタリスト

source: Console Counters Filter
ja_jp: コンソールカウンタフィルタ

source: Console: counters remove button
ja_jp: コンソール: カウンターはボタンを削除します。

source: Console Counters Remove Button
ja_jp: コンソールカウンターはボタンを削除します。

source: Console: counters remove modal
ja_jp: コンソール: カウンタはモーダルを削除します。

source: Console Counters Remove Modal
ja_jp: コンソールカウンターは、モーダルを削除します。

source: You can look at the https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12347011[release notes] to see what has changed.
ja_jp: 何が変わったのかは、 link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12347011[リリースノート] を見ればわかります。

source: Documentation
ja_jp: ドキュメント

source: https://infinispan.org/docs/dev/index.html[Our documentation has been updated] with some additional content as well as improvements for clarity and technical accuracy, notably:
ja_jp: いくつかの追加コンテンツで link:https://infinispan.org/docs/dev/index.html[ドキュメントが更新]され 、特に分かりやすさと技術的な正確さを向上させています。

source: Server Guide
ja_jp: サーバガイド

source: Guide to Cross-Site Replication
ja_jp: 拠点横断レプリケーションガイド

source: Security Guide
ja_jp: セキュリティガイド

source: As always, the Infinispan team hope you find the documentation useful and complete. We’d love to hear from you and really value feedback from our community. If you think something is missing from the docs or spot a correction, please get in touch and we’ll get on it straight away.
ja_jp: いつものように、Infinispanチームは、このドキュメントが有用で完全なものであることをご理解いただけることを願っています。皆様からのご意見をお待ちしており、コミュニティからのフィードバックを本当に大切にしています。ドキュメントに何かが欠けていると思われる場合や、修正点がある場合は、ご連絡ください。すぐに対応させていただきます。

source: Release notes
ja_jp: リリースノート

source: Server
ja_jp: サーバ

source: Console
ja_jp: コンソール

source: It's been a month since our first 12.1.0.Final release and we already released two additional minors with some bug fixes and upgrades. The latest version is 12.1.2.Final.
ja_jp: 最初の12.1.0.Finalのリリースから1ヶ月が経ちましたが、すでにいくつかのバグフィックスとアップグレードを含む2つの追加マイナーをリリースしました。その最新版が12.1.2.Finalです。

source: Highlights of Infinispan 12.1.1 and 12.1.2 include:
ja_jp: Infinispan 12.1.1および12.1.2のハイライトは以下の通りです。

source: Grafana Dashboards for the Operator https://issues.redhat.com/browse/ISPN-12702[ISPN-12702].
ja_jp: OperatorのためのGrafanaのダッシュボード link:https://issues.redhat.com/browse/ISPN-12702[ISPN-12702]。

source: Performance regression fix https://issues.redhat.com/browse/ISPN-13017[ISPN-13017].
ja_jp: パフォーマンスの退化を修正 link:https://issues.redhat.com/browse/ISPN-13017[ISPN-13017]

source: Index and Query statistics improved in the Infinispan Web Console https://issues.redhat.com/browse/ISPN-12458[ISPN-12458].
ja_jp: Infinispan Webコンソールでの索引と問い合せの統計情報の改善 link:https://issues.redhat.com/browse/ISPN-12458[ISPN-12458]

source: Several component upgrades
ja_jp: いくつかのコンポーネントのアップグレード

source: Documentation enchancements
ja_jp: ドキュメントの改善

source: You can find release notes for both versions at: https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12355542[here] and https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&version=12356461[here]
ja_jp: 両バージョンのリリースノートは、 link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&amp;version=12355542[こちら]と link:https://issues.redhat.com/secure/ReleaseNote.jspa?projectId=12310799&amp;version=12356461[こちら]をご覧ください。

source: We're proud to announce the release of Infinispan 11. In the tradition of assigning beer codenames to our releases, we decided that "Corona Extra" would be a significant representation of the period during which most of the development has happened. We hope that you, your families and friends have not been impacted by the pandemic.
ja_jp: Infinispan 11のリリースを発表できることを誇りに思います。私たちのリリースにビールのコードネームを付けるという伝統の中で、「コロナ・エクストラ」は、開発のほとんどが行われた期間を象徴するものであると判断しました。皆様、ご家族、ご友人の皆様がパンデミックの影響を受けていないことを願っています。

source: But didn't you release 10.x not long ago ?
ja_jp: しかし、10.xは少し前にリリースされていませんでしたか？

source: Indeed, but version numbers are just that: numbers. We are still continuing our near-quarterly releases, but, from now on, these will be identified by major version numbers.
ja_jp: 確かにそうですが、バージョン番号はあくまでも番号です。私たちはまだ四半期ごとのリリースを続けていますが、今後はメジャーバージョン番号で識別されるようになります。

source: So, what's new in Infinispan 11 ?
ja_jp: Infinispan 11の新機能は？

source: As usual we added new features, improved existing ones and prepared the groundwork for upcoming features.
ja_jp: いつものように、新しい機能を追加し、既存の機能を改善し、今後の機能のための下地を準備しました。

source: Conflict detection and resolution for Asynchronous Cross-Site Replication
ja_jp: 非同期拠点横断レプリケーションにおける衝突の検出と解決

source: Cross-site replication is one of our most used features, as it enables a number of very useful use-cases such as geographical load distribution, zero-downtime disaster recovery and follow-the-sun data centers.
ja_jp: 拠点横断レプリケーションは、地理的な負荷分散、ゼロダウンタイムの災害復旧、地理的に分散して24時間体制のデータセンタなど、多くの有用なユースケースを可能にするため、当社で最も利用されている機能の1つです。

source: In this release we completely overhauled the way we implement asynchronous cross-site replication by introducing conflict resolution, based on vector clocks, as well as multiple site masters to increase throughput and reliability. This means that you can have multiple active sites safely replicating data between each other.
ja_jp: このリリースでは、処理性能と信頼性を向上させるために、複数の拠点マスタと同様に、ベクトルクロックに基づく競合解決を導入することで、非同期拠点横断レプリケーションの実装方法を完全に整備しました。これにより、複数のアクティブな拠点がお互いの間で安全にデータを複製できるようになりました。

source: Server security overhaul
ja_jp: サーバセキュリティの整備

source: Infinispan Server's security, while very powerful, was also tricky to set up because of the configuration complexity. Since we wanted to make the link:/blog/2020/06/04/server-secure-by-default/[server secure by default], we put a lot of work in simplifying the configuration and removing all of the boilerplate. Additionally, if you are securing the server with https://keycloak.org[Keycloak], accessing the console will correctly obtain credentials through the realm login page.
ja_jp: Infinispanサーバのセキュリティは非常に強力ですが、設定が複雑なため、設定するのが厄介でした。 link:/blog/2020/06/04/server-secure-by-default/[デフォルトでサーバをセキュア] にしたかったので、設定を単純化し、すべての決まり文句を削除することに多くの労力を費やしました。さらに、 link:https://keycloak.org[Keycloak] でサーバを保護している場合、コンソールにアクセスすると、レルムのログインページから認証情報を正しく取得できます。

source: Non-blocking internals
ja_jp: ノンブロッキングの内部

source: Our quest to make better use of the available hardware resources in all deployment models (bare-metal, containerized, virtualized) continues as we've now consolidated a lot of thread-pools into just two: non-blocking and blocking. Most of the code now makes use of the non-blocking pool. Paths which may block, such as certain persistent stores, use the blocking pool so that they don't hold up work that may be processed without blocking. This release also includes a new non-blocking Store SPI, so that you can take advantage of stores with real non-blocking I/O.
ja_jp: すべてのデプロイメントモデル（ベアメタル、コンテナ化、仮想化）で利用可能なハードウェアリソースをよりよく利用するための探求は続いており、多くのスレッドプールをノンブロッキングとブロッキングの 2 つに統合しました。現在、ほとんどのコードはノンブロッキングプールを使用しています。特定の永続的なストアなど、ブロックされる可能性のあるパスは、ブロッキングなしで処理される可能性のある作業を保持しないように、ブロッキングプールを使用します。このリリースには新しいノンブロッキングストア SPI も含まれており、実際のノンブロッキング I/O でストアを利用できるようになっています。

source: Clustering
ja_jp: クラスタリング

source: As Infinispan is participating in https://cloudbutton.eu/[CloudButton], a Serverless Data Analytics Platform which is part of the https://ec.europa.eu/programmes/horizon2020/[European Union's Horizon 2020 research and innovation programme], we have introduced a new optional feature which allows scaling by adding new nodes to a cluster without state-transfer. This means that you can add capacity with zero-impact to your operations. Obviously this comes at the cost of reduced resilience in case of failures, but, for scenarios where high availability is not required, this gives you a highly scalable in-memory storage solution.
ja_jp: Infinispanは、 link:https://ec.europa.eu/programmes/horizon2020/[欧州連合（EU）の研究・イノベーションプログラムHorizon 2020] 」の一環であるサーバレスデータ分析プラットフォーム link:https://cloudbutton.eu/[CloudButton] 」に参加していることから、状態遷移なしに新しいノードをクラスタに追加して拡張をを可能にするオプション機能を新たに導入しました。これは、運用への影響をゼロにして容量を追加できることを意味します。明らかに、これは障害が発生した場合の回復力を低下させるという代償を伴いますが、高可用性を必要としないシナリオでは、拡張性の高いインメモリ・ストレージ・ソリューションを提供します。

source: If high availability is your thing, the rebalancing algorithm which decides how segments (our subdivision of the data space) are mapped to nodes has been overhauled to be much more accurate and fairer.
ja_jp: 高可用性がお望みなら、セグメント（データ空間の細分化）がどのようにノードにマップされるかを決定する再配置アルゴリズムが、より正確で公平なものになるように見直されました。

source: Query/Indexing
ja_jp: 問い合わせ/索引

source: Querying and indexing will be the major focus in Infinispan 12 (with the long awaited upgrade to https://hibernate.org/search/[Hibernate Search 6] and https://lucene.apache.org/[Lucene 8]). In preparation for that, *a lot* of work has gone into deprecations, usability, clean ups and documentation.
ja_jp: 問い合わせと索引作成は Infinispan 12 の主要な焦点となるでしょう ( link:https://hibernate.org/search/[Hibernate Search 6] と link:https://lucene.apache.org/[Lucene 8] への待望のアップグレードもあります)。その準備として、非推奨、扱いやすさ、手入れ、文書化に *多くの* 作業が行われました。

source: Many usability changes have been added to our Java Hot Rod client:
ja_jp: Java Hot Rodクライアントに多くの使い勝手の変更が追加されました。

source: a Hot Rod URI as a compact way to configure a connection
ja_jp: 接続を設定するためのコンパクトな方法としての Hot Rod URI

source: automatic creation of caches on demand using supplied configurations/templates with support for wildcards
ja_jp: ワイルドカードに対応した設定/テンプレートを使用して、要求に応じてキャッシュを自動生成します。

source: improved iteration of entries by concurrently splitting work across segments/nodes
ja_jp: セグメント/ノード間で作業を並行して分割することで、要素の反復処理が改善されました。

source: Other Server changes
ja_jp: その他サーバーの変更

source: If you are using the JDBC cache store to persist your cache entries to a database, Infinispan Server now restores the ability to create shared datasources which was lost when we abandoned the WildFly base.
ja_jp: JDBC キャッシュストアを使用してキャッシュ要素をデータベースに永続化する場合、Infinispanサーバは WildFly ベースを取り除いたときに失われた共有データソースを作成する機能を復元します。

source: The CLI received a number of new features such as logging manipulation, obtaining sever reports and user management, superseding the `user-tool` script.
ja_jp: CLIには、ログ操作、サーバレポートの取得、ユーザー管理、 `user-tool` スクリプトの上書きなど、多くの新機能が導入されました。

source: Our console overhaul, which started in 10, continues with lots of new features, integrations and polishing. Highlights are:
ja_jp: 10年前にスタートしたコンソールは、多くの新機能、統合、洗練を続けています。ハイライトは以下の通りです。

source: Clouds, containers and operators
ja_jp: クラウド、コンテナ、オペレータ

source: Our Infinispan Server image is now based on `ubi-minimal:8.2`.
ja_jp: Infinispan サーバーイメージは `ubi-minimal:8.2` に基づいています。

source: And thanks to our friends over at https://quarkus.io[Quarkus], Infinispan Server is now also available as a native image built using https://graalvm.org[GraalVM]. This image is available on Quay.io and Docker Hub.
ja_jp: そして、 link:https://quarkus.io[Quarkus] という友人のおかげで、Infinispanサーバは link:https://graalvm.org[GraalVMを] 使ってビルドされたネイティブイメージとしても利用できるようになりました。このイメージはQuay.ioとDocker Hubで利用可能です。

source: The Kubernetes Operator adds a new Cache Custom Resource and the ability to expose services via Ingress and Routes.
ja_jp: Kubernetesオペレータでは、新しいCache Custom ResourceとIngressとRoutes経由でサービスを公開する機能が追加されています。

source: Documentation has also received a lot of love in all areas:
ja_jp: ドキュメンテーションもすべての分野で多くの愛を受けています。

source: Added procedural content for rolling upgrades, Cache CR with the Operator, server patching, misc CLI commands, using RemoteCacheConfigurationBuilder.
ja_jp: RemoteCacheConfigurationBuilder を使用した、ローリング・アップグレードの手続き的なコンテンツ、オペレータとの Cache CR、サーバのパッチ適用、その他 CLI コマンドが追加されました。

source: Procedural content for different upgrade and migration tasks included in Upgrade Guide.
ja_jp: アップグレードガイドに含まれるさまざまなアップグレードおよび移行作業のための手続き内容です。

source: Operator and Spring Boot Starter guides now provide stable and development versions from the index page.
ja_jp: オペレータとSpring Boot Starterガイドでは、索引ページから安定版と開発版を提供するようになりました。

source: Updated index.html and throughout documentation to improve high-level context and aid retrievability.
ja_jp: index.htmlとドキュメント全体を更新し、高レベルのコンテキストと検索性を向上させました。

source: Getting Started content updated and streamlined.
ja_jp: 入門のコンテンツが更新され、合理化されました。

source: Applied several modifications, additions, and removals to documentation via community feedback.
ja_jp: コミュニティのフィードバックを介して、いくつかの変更、追加、削除をドキュメントに適用しました。

source: What's next ?
ja_jp: 次は何をするの？

source: As briefly mentioned above, Infinispan 12 will be our next release, scheduled for this autumn. We will be working on query/index improvements, backup/restore capabilities as well as the usual load of improvements, clean-ups across the board. We will keep you posted with development release and blogs about upcoming highlights. If you'd like to contribute, just get in touch.
ja_jp: 上記で簡単に述べたように、Infinispan 12 は、この秋に予定されている次のリリースとなります。問い合わせ/索引の改善、バックアップ/リストア機能、さらには通常の改善や手入れにも取り組んでいく予定です。今後のハイライトについては、開発リリースやブログでお知らせしていきます。貢献したい方は、ご連絡ください。

source: Last week I released version 3.0.0.Final of wildfly-clustering-spring-session, a new Spring Session implementation based on WildFly's distributed HttpSession manager and Infinispan.
ja_jp: 先週、WildFlyの分散型HttpSessionマネージャとInfinispanをベースにした新しいSpring Sessionの実装であるwildfly-clustering-spring-sessionのバージョン3.0.0.Finalをリリースしました。

source: Doesn't Infinispan already provide a Spring Session implementation?
ja_jp: InfinispanはすでにSpring Sessionの実装を提供しているのではないでしょうか？

source: https://infinispan.org/docs/stable/titles/integrating/integrating.html#spring_externalize_sessions[Yes, it does.]
ja_jp: link:https://infinispan.org/docs/stable/titles/integrating/integrating.html#spring_externalize_sessions[その通りです。]

source: Infinispan's existing Spring Session implementation stores instances of `org.springframework.session.MapSession` into a Spring cache, which is backed by either an embedded or remote cache.
ja_jp: Infinispanの既存のSpring Session実装は、 `org.springframework.session.MapSession` のインスタンスをSpringのキャッシュに格納します。このキャッシュは、組み込みキャッシュまたはリモートキャッシュによって支えられています。

source: However, like many `MapSession` based `SessionRepository` implementations, it suffers from a common set of problems/limitations:
ja_jp: しかし、多くの `MapSession` ベースの `SessionRepository` の実装と同様に、共通の問題/限界に悩まされています。

source: The `MapSession` object, including all session metadata and attributes must be serialized and replicated/persisted on every request, regardless of the extent to which the session was modified.
ja_jp: `MapSession` オブジェクトは、すべてのセッションのメタデータと属性を含めてシリアル化され、セッションがどの程度変更されたかにかかわらず、すべてのリクエストで複製/永続化されなければなりません。

source: Because Spring Session triggers session persistence from a `ServletFilter`, this cost is borne per request.
ja_jp: Spring Sessionは、 `ServletFilter` からセッションの永続化をトリガーするため、このコストはリクエストごとに発生します。

source: Since each request for a given session operates on a copy of the `MapSession`, and since the `MapSession` is not persisted/replicated until the end of the request:
ja_jp: 与えられたセッションの各リクエストは、 `MapSession` のコピーを操作するため、また、 `MapSession` は、リクエストが終了するまで永続化/複製されないためです。

source: Session modifications in one requests are not visible to concurrent requests for the same session.
ja_jp: あるリクエストでのセッションの変更は、同じセッションで同時に起こっているリクエストでは見えません。

source: A given session modification can be overwritten by a previous modification of the same session from a concurrent request if that request finishes first.
ja_jp: あるセッションの変更は、同時に行われたリクエストによる同じセッションの以前の変更によって上書きされる可能性があります（そのリクエストが先に終了した場合）。

source: Session attributes implementing `HttpSessionActivationListener` are never notified before/after they are marshalled/unmarshalled.
ja_jp: `HttpSessionActivationListener` を実装しているセッション属性は、マーシャリング/アンマーシャリングされる前/後に通知されることはありません。

source: How does it work?
ja_jp: どのような仕組みになっているのですか？

source: wildfly-clustering-spring-session is implemented as a Spring `SessionRepository` facade to a container-independent `SessionManager` implementation that persists session attributes and metadata to either an embedded Infinispan cache or a remote Infinispan server cluster via HotRod. This grants all of the features to Spring Session that one would normally expect when deploying a distributed web application to WildFly, including:
ja_jp: wildfly-clustering-spring-sessionは、Springの `SessionRepository` ファサードとして、コンテナに依存しない `SessionManager` を実装しています。この実装は、セッションの属性とメタデータを、組み込みのInfinispanキャッシュか、HotRod経由でリモートのInfinispanサーバクラスタに永続化します。これにより、Spring Sessionにすべての機能が付与されます。これは、分散型WebアプリケーションをWildFlyにデプロイする際に通常期待される、以下のような機能です。

source: Minimal persistence payloads using configurable persistence granularity.
ja_jp: 設定可能な永続性の粒度を使用した最小の永続性ペイロード。

source: Consistent view of a given session from multiple concurrent request threads on a given server
ja_jp: 特定のサーバー上で複数の同時に処理されるリクエストスレッドからの特定のセッションの一貫したビュー

source: Mutable session attribute semantics (emulates the semantics of local session manager)
ja_jp: 変更可能なセッション属性の意味（ローカルセッションマネージャの意味を模倣）

source: Ability to treat specific session attributes as immutable
ja_jp: 特定のセッション属性を不変のものとして扱う機能

source: Configurable limit for the number of active sessions to retain in memory
ja_jp: メモリに保持するアクティブなセッションの数を設定可能

source: Proper `HttpSessionActivationListener` notifications.
ja_jp: 適切な `HttpSessionActivationListener` の通知。

source: Configurable session attribute marshaller (ProtoStream, JBoss Marshalling, or Java Serialization)
ja_jp: 設定可能なセッション属性マーシャラー（ProtoStream、JBoss Marshalling、またはJava Serialization

source: How do I use it?
ja_jp: どうやって使うの？

source: In this example, we'll use a remote Infinispan cluster containing a single member, deployed to the localhost, using its default configuration. See the project https://github.com/wildfly-clustering/wildfly-clustering-spring-session/blob/master/README.md[README] for details on the available configuration annotations and their attributes.
ja_jp: この例では、1つのメンバーを含むリモートのInfinispanクラスタを使用し、デフォルトの構成を使用してlocalhostにデプロイします。利用可能な構成アノテーションとその属性の詳細については、プロジェクトの link:https://github.com/wildfly-clustering/wildfly-clustering-spring-session/blob/master/README.md[README]を参照してください。

source: Create a class containing the session repository configuration, for example:
ja_jp: セッション・リポジトリの設定を含むクラスを作成します。たとえば

source: Ensure your `/WEB-INF/applicationContext.xml` will process your configuration annotation:
ja_jp: `/WEB-INF/applicationContext.xml` が構成アノテーションを処理できることを確認してください。
